---
title: LinearDimension
classe: Autodesk.Revit.DB.LinearDimension
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Dimension
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 1
---

# LinearDimension

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `LinearDimension Create(Document, View, Line, IList<Reference>)` | `LinearDimension.Create(document, dbView, line, references)` | LinearDimension |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```